# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N

num = int (input('Введите число N --- '))
i=1
print('0')
while i <= num:
    print(i)
    i=i*2

    
    
