# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
dict = { 
        '1': {'А','В','Е','И','Н','О','Р','С','Т'},
        '2': {'Д','К','Л','М','П','У'},
        '3': {'Б','Г','Ё','Ь','Я'},
        '4': {'Й','Ы'},
        '5': {'Ж','З','Х','Ц','Ч'},
        '8': {'Ш','Э','Ю'},
        '10':{'Ф','Щ','Ъ'}
        }
k = 'АВД'
sum = 0
key = 0
for i in k:
    sum += key
    for j, l in dict.items():
        if l == i:
            key = j   
          
print(sum)